Pandas基于两种数据类型：Series和DataFrame  

Series是Pandas中最基本的对象，类似一种一位数组。事实上，Series基本上就是基于Numpy的数组对象生成的。但与Numpy的数组不同，Series能为数据自定义标签，称为索引（index），然后通过索引来访问数组中的数据。  

DataFrame是一个二维的表结构。Pandas的DataFrame可以存储许多种不同的数据类型，并且每一个坐标轴都有自己的标签。可以理解为Series的字典项。

# Series

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
# 创建Series对象并省略索引
sel = Series([1,2,3,4])
sel

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
sel = Series(data = [1,2,3,4], index = list('abcd'))
sel

a    1
b    2
c    3
d    4
dtype: int64

当然也可以直接将index改掉：

In [4]:
sel = Series(data = [1,2,3,4], index = ['a','b','c','d'])
sel

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
# 输出value
sel.values

array([1, 2, 3, 4], dtype=int64)

In [6]:
# 输出index
sel.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [7]:
# 输出键值对
sel.iteritems()

In [8]:
list(sel.iteritems())

[('a', 1), ('b', 2), ('c', 3), ('d', 4)]

还可以直接把一个dict转换为Series：

In [9]:
dict1 = {'red':100, 'black':400, 'green':300, 'pink':900}
dict1

{'red': 100, 'black': 400, 'green': 300, 'pink': 900}

In [10]:
se3 = Series(dict1)
se3

red      100
black    400
green    300
pink     900
dtype: int64

In [11]:
# Series数据获取
sel = Series(data = [1,2,3,4], index = list('abcd'))
sel

a    1
b    2
c    3
d    4
dtype: int64

特别的，Series对象同时支持**位置**和**标签**两种方式获取数据：

In [12]:
# 索引下标
sel['c']

3

In [13]:
# 位置下标
sel[2]

3

Note: Series还是从0开始，这跟字典不同。

In [14]:
# 也可以同时输出多个位置下标（索引下标也可）
sel[[1,3]]

b    2
d    4
dtype: int64

In [15]:
# 还是可以使用切片
sel[1:3]

b    2
c    3
dtype: int64

依旧符合左开右闭原则。

特别的，如果使用索引下标，则不是左开右闭，而是闭区间：

In [16]:
sel['b':'d']

b    2
c    3
d    4
dtype: int64

In [17]:
# 更改索引
sel.index = list('dcba')
sel

d    1
c    2
b    3
a    4
dtype: int64

In [18]:
# 使用reindex 重新索引，会返回一个新的Series（会重新排序，缺失值用NaN填充）
sel.reindex(list('bacde'))

b    3.0
a    4.0
c    2.0
d    1.0
e    NaN
dtype: float64

In [19]:
sel

d    1
c    2
b    3
a    4
dtype: int64

In [20]:
# Drop 丢弃指定轴上的项
sel = Series(range(10,15))
sel

0    10
1    11
2    12
3    13
4    14
dtype: int64

In [21]:
sel.drop([2,3]) # drop函数还是另外写入而非直接更改

0    10
1    11
4    14
dtype: int64

In [22]:
sel

0    10
1    11
2    12
3    13
4    14
dtype: int64

### Series进行四则运算

In [23]:
se1 = Series([1,2,3,4], ['London','HonkKong','Tokyo','Beijing'])
se2 = Series([1,3,4,5], ['London','Singapore','Beijing','Dubai'])

In [24]:
se1 + se2

Beijing      8.0
Dubai        NaN
HonkKong     NaN
London       2.0
Singapore    NaN
Tokyo        NaN
dtype: float64

Note: 可以看到，如果不是两个表都存在的value会返回NaN。

In [25]:
se1 - se2

Beijing      0.0
Dubai        NaN
HonkKong     NaN
London       0.0
Singapore    NaN
Tokyo        NaN
dtype: float64

In [26]:
se1 * se2

Beijing      16.0
Dubai         NaN
HonkKong      NaN
London        1.0
Singapore     NaN
Tokyo         NaN
dtype: float64

In [27]:
# 同样支持Numpy的数组运算
sel = Series(data = [1,6,3,5], index = list('abcd'))
sel

a    1
b    6
c    3
d    5
dtype: int64

In [28]:
sel[sel>3]

b    6
d    5
dtype: int64

In [29]:
sel*2

a     2
b    12
c     6
d    10
dtype: int64

In [30]:
# 可以直接加入Numpy的数学函数
np.square(sel)

a     1
b    36
c     9
d    25
dtype: int64

# DataFrame
DataFrame（数据表）是一种二维数据结构，以表格的形式存储，分成了若干的行和列。

In [31]:
df = DataFrame(np.random.randint(0,14,(4,4)), index = range(1,5), columns = list('abcd'))
df

   a   b  c  d
1  7  12  5  4
2  2   2  3  0
3  5   0  8  0
4  0   3  1  0

In [32]:
# 使用字典创建(行索引由index决定，列索引由values决定)
dict1 = {
    'Province': ['Guangdong','Beijing','Sichuan','Zhejiang'],
    'pop': [1.3, 2.5, 1.1, 0.7],
    'year': [2019, 2019, 2019, 2019]
}
dict1

{'Province': ['Guangdong', 'Beijing', 'Sichuan', 'Zhejiang'],
 'pop': [1.3, 2.5, 1.1, 0.7],
 'year': [2019, 2019, 2019, 2019]}

In [33]:
df2 = DataFrame(dict1, index = range(1,5))
df2

    Province  pop  year
1  Guangdong  1.3  2019
2    Beijing  2.5  2019
3    Sichuan  1.1  2019
4   Zhejiang  0.7  2019

In [34]:
data = {
    'Name': Series(['ab','cd','ef'], index = list('abc')),
    'Age': Series(range(10,50,10), index = list('abcd')),
    'country': Series(['中国','日本','韩国'], index = list('acb'))
}
data

{'Name': a    ab
 b    cd
 c    ef
 dtype: object, 'Age': a    10
 b    20
 c    30
 d    40
 dtype: int64, 'country': a    中国
 c    日本
 b    韩国
 dtype: object}

In [35]:
df = DataFrame(data)
df

  Name  Age country
a   ab   10      中国
b   cd   20      韩国
c   ef   30      日本
d  NaN   40     NaN

Note: 缺失值用NaN填充。

In [36]:
# 使用to_dict()将DataFrame对象转换为dict
df.to_dict()

{'Name': {'a': 'ab', 'b': 'cd', 'c': 'ef', 'd': nan},
 'Age': {'a': 10, 'b': 20, 'c': 30, 'd': 40},
 'country': {'a': '中国', 'b': '韩国', 'c': '日本', 'd': nan}}

### DataFrame对象常用属性

In [37]:
dict2 = {
    'name':['James','Durant','Curry'],
    'age': [22, 19, 20],
    'nationality': ['USA','USA','USA']
}
dict2

{'name': ['James', 'Durant', 'Curry'],
 'age': [22, 19, 20],
 'nationality': ['USA', 'USA', 'USA']}

In [38]:
df = pd.DataFrame(data = dict2, index = list('123'))
df

     name  age nationality
1   James   22         USA
2  Durant   19         USA
3   Curry   20         USA

In [39]:
df.shape

(3, 3)

In [40]:
# 获取行索引
df.index.tolist()

['1', '2', '3']

In [41]:
# 获取列索引
df.columns.tolist()

['name', 'age', 'nationality']

In [42]:
df.dtypes

name           object
age             int64
nationality    object
dtype: object

In [43]:
# 获取数据的维度
df.ndim

2

In [44]:
# values属性也会以二维ndarray的形式返回DataFrame的数据
df.values

array([['James', 22, 'USA'],
       ['Durant', 19, 'USA'],
       ['Curry', 20, 'USA']], dtype=object)

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 1 to 3
Data columns (total 3 columns):
name           3 non-null object
age            3 non-null int64
nationality    3 non-null object
dtypes: int64(1), object(2)
memory usage: 96.0+ bytes

In [46]:
# 显示头几行
df.head(2)

     name  age nationality
1   James   22         USA
2  Durant   19         USA

In [47]:
# 默认会显示前五行
df.head()

     name  age nationality
1   James   22         USA
2  Durant   19         USA
3   Curry   20         USA

In [48]:
df.tail(1)

    name  age nationality
3  Curry   20         USA

In [49]:
df

     name  age nationality
1   James   22         USA
2  Durant   19         USA
3   Curry   20         USA

In [50]:
# 显示name列
df['name']

1     James
2    Durant
3     Curry
Name: name, dtype: object

In [51]:
# 只获取一列，所以返回的是一个Series
type(df['name'])

pandas.core.series.Series

In [52]:
df[['name','age']]

     name  age
1   James   22
2  Durant   19
3   Curry   20

In [53]:
# 返回的是一个DataFrame类型
type(df[['name','age']])

pandas.core.frame.DataFrame

In [54]:
df[0:1] # 不能直接写df[0]

    name  age nationality
1  James   22         USA

但是不能选取多行多列：
```python3
df[1:3]['name','age']
```
会报错。

`df.loc` 通过标签索引行数据  
`df.iloc` 通过位置获取行数据

In [55]:
df.loc['1','name']

'James'

In [56]:
df.loc['1',:]

name           James
age               22
nationality      USA
Name: 1, dtype: object

In [57]:
df.loc['1',['name','nationality']]

name           James
nationality      USA
Name: 1, dtype: object

In [58]:
df.loc['0':'2', ['name','nationality']]

     name nationality
1   James         USA
2  Durant         USA

In [59]:
df.loc[['0','2'],['name','nationality']]

D:\Anaconda3\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

     name nationality
0     NaN         NaN
2  Durant         USA

In [60]:
# 取行
df.iloc[1]

name           Durant
age                19
nationality       USA
Name: 2, dtype: object

In [61]:
df.iloc[0:2] # 同样是左开右闭

     name  age nationality
1   James   22         USA
2  Durant   19         USA

In [62]:
df.iloc[[0,2],:]

    name  age nationality
1  James   22         USA
3  Curry   20         USA

In [63]:
# 取一列
df.iloc[:,1]

1    22
2    19
3    20
Name: age, dtype: int64

In [64]:
df.iloc[1,0]

'Durant'

In [65]:
# 修改值
df.iloc[0,0] = 'Paul'
df

     name  age nationality
1    Paul   22         USA
2  Durant   19         USA
3   Curry   20         USA

In [66]:
# dataframe 排序
df.sort_values(by = 'age', ascending = False) # 默认为升序

     name  age nationality
1    Paul   22         USA
3   Curry   20         USA
2  Durant   19         USA

### DataFrame修改index、colunms

In [67]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3), index = ['bj','sh','sz'],
                  columns = ['a','b','c'])
df1

    a  b  c
bj  0  1  2
sh  3  4  5
sz  6  7  8

In [68]:
df1.index

Index(['bj', 'sh', 'sz'], dtype='object')

In [69]:
df1.index = ['Beijing','Shanghai','Guangzhou']
df1

           a  b  c
Beijing    0  1  2
Shanghai   3  4  5
Guangzhou  6  7  8

In [70]:
def testMap(x):
    return x + '_ABC'

inplace: 布尔值，默认为False，指定是否返回新的DataFrame。如果为True，则在原df上修改，返回值为None

In [71]:
df.rename(index = testMap, columns = testMap, inplace = True)
df

      name_ABC  age_ABC nationality_ABC
1_ABC     Paul       22             USA
2_ABC   Durant       19             USA
3_ABC    Curry       20             USA

同时，rename 还可以传入字典，为某个index 单独修改名称:

In [72]:
df3 = df1.rename(index = {'Beijing':'Shenzhen'}, columns = {'a':'A'})
df3

           A  b  c
Shenzhen   0  1  2
Shanghai   3  4  5
Guangzhou  6  7  8

In [73]:
# 列转换为索引
df4 = pd.DataFrame({'X':range(5), 'Y':range(5), 'S':list("abcde"), 'Z':[1,1,2,2,2]})
df4

   X  Y  S  Z
0  0  0  a  1
1  1  1  b  1
2  2  2  c  2
3  3  3  d  2
4  4  4  e  2

In [74]:
# 指定一列为索引
result = df4.set_index('S', drop = False) # drop = False 指定同时保留作为索引的列
result.index.name = None
result

   X  Y  S  Z
a  0  0  a  1
b  1  1  b  1
c  2  2  c  2
d  3  3  d  2
e  4  4  e  2

In [75]:
# # 行转索引

# result = df4.set_axis(df1.iloc[0], axis = 1, inplace = False)
# result.columns.name = None
# result

### 添加数据

In [76]:
df1 = pd.DataFrame([['Snow','M',22],['Tyrion','M',32],['Sansa','F',18],['Arya','F',14]],
                  columns = ['name','gender','age'])
df1

     name gender  age
0    Snow      M   22
1  Tyrion      M   32
2   Sansa      F   18
3    Arya      F   14

In [77]:
# 在最后添加score一列
df1['score']=[80,98,67,90]
df1

     name gender  age  score
0    Snow      M   22     80
1  Tyrion      M   32     98
2   Sansa      F   18     67
3    Arya      F   14     90

Note: 在具体位置使用insert方法
```python
# 语法格式：列表.insert(index,obj)
# index ---> 对象obj 需要插入的索引位置
# obj ---> 要插入列表中的对象（列名）
```

In [78]:
col_name = df1.columns.tolist() # 将数据框的列名全部提取出来存放在列表里
col_name

['name', 'gender', 'age', 'score']

In [79]:
col_name.insert(2,'city') # 在列索引为2的地方插入一列名为city
col_name

['name', 'gender', 'city', 'age', 'score']

In [80]:
df1

     name gender  age  score
0    Snow      M   22     80
1  Tyrion      M   32     98
2   Sansa      F   18     67
3    Arya      F   14     90

In [81]:
df1 = df1.reindex(columns = col_name)  # DataFrame.reindex()对原行/列索引重新构建索引值
df1

     name gender  city  age  score
0    Snow      M   NaN   22     80
1  Tyrion      M   NaN   32     98
2   Sansa      F   NaN   18     67
3    Arya      F   NaN   14     90

In [82]:
df1['city'] = ['Beijing', 'Shanghai','Shenzhen','Guangzhou']
df1

     name gender       city  age  score
0    Snow      M    Beijing   22     80
1  Tyrion      M   Shanghai   32     98
2   Sansa      F   Shenzhen   18     67
3    Arya      F  Guangzhou   14     90

往df中使用insert插入一列：
     ```
     df.insert(iloc,column,value)
     iloc: 插入位置
     column: 列名
     value: 值
     ```

In [83]:
df1

     name gender       city  age  score
0    Snow      M    Beijing   22     80
1  Tyrion      M   Shanghai   32     98
2   Sansa      F   Shenzhen   18     67
3    Arya      F  Guangzhou   14     90

In [84]:
df1.insert(2, 'class', [1,2,1,1])
df1

     name gender  class       city  age  score
0    Snow      M      1    Beijing   22     80
1  Tyrion      M      2   Shanghai   32     98
2   Sansa      F      1   Shenzhen   18     67
3    Arya      F      1  Guangzhou   14     90

In [85]:
# 行修改

row = ['Jayway','M','3','Chengdu',23,100] 
df1.iloc[1] = row
df1

     name gender class       city  age  score
0    Snow      M     1    Beijing   22     80
1  Jayway      M     3    Chengdu   23    100
2   Sansa      F     1   Shenzhen   18     67
3    Arya      F     1  Guangzhou   14     90

### 合并数据

In [86]:
"""
pd.concat(objs,axis,ignore_index)
objs: 合并对象
axis: 合并方式，默认0位按列合并，1为按行合并
ignore_index: 是否忽略索引
"""
df1 = pd.DataFrame(np.arange(6).reshape(3,2), columns = ['four','five'])
df1

   four  five
0     0     1
1     2     3
2     4     5

In [87]:
df2 = pd.DataFrame(np.arange(6).reshape(2,3), columns = ['one','two','three'])
df2

   one  two  three
0    0    1      2
1    3    4      5

In [88]:
result = pd.concat([df1,df2], axis = 1)
result

   four  five  one  two  three
0     0     1  0.0  1.0    2.0
1     2     3  3.0  4.0    5.0
2     4     5  NaN  NaN    NaN

In [89]:
result = pd.concat([df1,df2],axis = 0,ignore_index = True)
result

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   five  four  one  three  two
0   1.0   0.0  NaN    NaN  NaN
1   3.0   2.0  NaN    NaN  NaN
2   5.0   4.0  NaN    NaN  NaN
3   NaN   NaN  0.0    2.0  1.0
4   NaN   NaN  3.0    5.0  4.0

### 删除数据

In [90]:
"""
df.drop(labels, axis, inplace)
labels: 删除的标签
axis: 默认0为删除行，1为删除列
inplace: 是否在当前df中执行
"""
df2 = pd.DataFrame(np.arange(9).reshape(3,3), columns = ['one','two','three'])
df2

   one  two  three
0    0    1      2
1    3    4      5
2    6    7      8

In [91]:
df3 = df2.drop(['one'],axis = 1,inplace = False)
df3

   two  three
0    1      2
1    4      5
2    7      8

In [92]:
df2

   one  two  three
0    0    1      2
1    3    4      5
2    6    7      8

In [93]:
df3 = df2.drop([0,1], axis = 0, inplace = False)
df3

   one  two  three
2    6    7      8

# 数据处理

### Series对象

In [94]:
from numpy import nan as NaN
se = pd.Series([4,NaN,8,NaN,5])
se

0    4.0
1    NaN
2    8.0
3    NaN
4    5.0
dtype: float64

通过`dropna()`滤除缺失数据：

In [95]:
se.dropna()

0    4.0
2    8.0
4    5.0
dtype: float64

In [96]:
se

0    4.0
1    NaN
2    8.0
3    NaN
4    5.0
dtype: float64

In [97]:
se.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [98]:
se.isnull()

0    False
1     True
2    False
3     True
4    False
dtype: bool

还可以通过布尔序列滤除：

In [99]:
se[se.notnull()]

0    4.0
2    8.0
4    5.0
dtype: float64

### DataFrame对象

In [100]:
df1 = pd.DataFrame([[1,2,3],[NaN,NaN,2],[NaN,NaN,NaN],[8,8,9]])
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  2.0
2  NaN  NaN  NaN
3  8.0  8.0  9.0

In [101]:
df1.dropna() # 清除所有含有NaN的行

     0    1    2
0  1.0  2.0  3.0
3  8.0  8.0  9.0

In [102]:
df1.dropna(how = 'all') # 默认的how为any

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  2.0
3  8.0  8.0  9.0

In [103]:
df1.dropna(axis = 1) # 默认的axis = 0

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [104]:
df1.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  2.0
2  NaN  NaN  NaN
3  8.0  8.0  9.0

In [105]:
df1.dropna(thresh = 1) # 至少保留n个非NaN数据的行

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  2.0
3  8.0  8.0  9.0

### 填充缺失数据

In [106]:
df1 = pd.DataFrame([[1,2,3],[NaN,NaN,6],[NaN,NaN,NaN],[8,9,NaN]])
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  6.0
2  NaN  NaN  NaN
3  8.0  9.0  NaN

使用常数填充fillna:

In [107]:
df1.fillna(0)

     0    1    2
0  1.0  2.0  3.0
1  0.0  0.0  6.0
2  0.0  0.0  0.0
3  8.0  9.0  0.0

In [108]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  6.0
2  NaN  NaN  NaN
3  8.0  9.0  NaN

In [109]:
df1.fillna(0, inplace = True)
df1

     0    1    2
0  1.0  2.0  3.0
1  0.0  0.0  6.0
2  0.0  0.0  0.0
3  8.0  9.0  0.0

In [110]:
df1 = pd.DataFrame([[1,2,3],[NaN,NaN,6],[NaN,NaN,NaN],[8,9,NaN]])
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  6.0
2  NaN  NaN  NaN
3  8.0  9.0  NaN

In [111]:
# 通过字典来传入
df1.fillna({0:10,1:20,2:30})

      0     1     2
0   1.0   2.0   3.0
1  10.0  20.0   6.0
2  10.0  20.0  30.0
3   8.0   9.0  30.0

可以看到这里是以列索引作为字典的索引。

In [112]:
# 以列平均值填充
df1.fillna(df1.mean())

     0    1    2
0  1.0  2.0  3.0
1  4.5  5.5  6.0
2  4.5  5.5  4.5
3  8.0  9.0  4.5

In [113]:
# 只填充一列
df1.iloc[:,1].fillna(5,inplace = False)

0    2.0
1    5.0
2    5.0
3    9.0
Name: 1, dtype: float64

In [114]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  6.0
2  NaN  NaN  NaN
3  8.0  9.0  NaN

In [115]:
df1.iloc[:,1].fillna(5,inplace = True)
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  NaN  5.0  NaN
3  8.0  9.0  NaN

In [116]:
# 使用method = " " 改变插值方式
df2 = pd.DataFrame(np.random.randint(0,10,(5,5)))
df2

   0  1  2  3  4
0  1  8  7  2  8
1  4  0  7  2  6
2  8  0  3  4  5
3  4  6  1  5  2
4  5  3  4  2  8

In [117]:
df2.iloc[1:4,3] = NaN
df2

   0  1  2    3  4
0  1  8  7  2.0  8
1  4  0  7  NaN  6
2  8  0  3  NaN  5
3  4  6  1  NaN  2
4  5  3  4  2.0  8

In [118]:
# 用前面的值来填充 ffill, 用后面的值来填充 bfill
df2.fillna(method = 'ffill')

   0  1  2    3  4
0  1  8  7  2.0  8
1  4  0  7  2.0  6
2  8  0  3  2.0  5
3  4  6  1  2.0  2
4  5  3  4  2.0  8

In [119]:
df2

   0  1  2    3  4
0  1  8  7  2.0  8
1  4  0  7  NaN  6
2  8  0  3  NaN  5
3  4  6  1  NaN  2
4  5  3  4  2.0  8

In [120]:
# 用limit可以限制行数
df2.fillna(method = 'bfill', limit = 1)

   0  1  2    3  4
0  1  8  7  2.0  8
1  4  0  7  NaN  6
2  8  0  3  NaN  5
3  4  6  1  2.0  2
4  5  3  4  2.0  8

In [121]:
df2

   0  1  2    3  4
0  1  8  7  2.0  8
1  4  0  7  NaN  6
2  8  0  3  NaN  5
3  4  6  1  NaN  2
4  5  3  4  2.0  8

In [122]:
# 用axis修改填充方向
df2.fillna(method = 'ffill', axis = 1)

     0    1    2    3    4
0  1.0  8.0  7.0  2.0  8.0
1  4.0  0.0  7.0  7.0  6.0
2  8.0  0.0  3.0  3.0  5.0
3  4.0  6.0  1.0  1.0  2.0
4  5.0  3.0  4.0  2.0  8.0

### 去重

In [125]:
"""
DataFrame 中经常会出现重复行，利用duplicated()函数返回每一行判断是否重复的结果（重复为True）
"""

df1 = pd.DataFrame({'A':[1,1,2,2,3,3,1], 'B':list("aabbcca")})
df1

   A  B
0  1  a
1  1  a
2  2  b
3  2  b
4  3  c
5  3  c
6  1  a

In [126]:
# 判断是否重复
df1.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [128]:
# 去重 drop_duplicates()
df1.drop_duplicates()

   A  B
0  1  a
2  2  b
4  3  c

In [129]:
df1

   A  B
0  1  a
1  1  a
2  2  b
3  2  b
4  3  c
5  3  c
6  1  a

In [130]:
# 去除指定的重复行
df1.drop_duplicates(['A'])

   A  B
0  1  a
2  2  b
4  3  c

In [132]:
# 保留重复行的最后一行
df1.drop_duplicates(['A'], keep = 'last')

   A  B
3  2  b
5  3  c
6  1  a

### 数据合并

In [134]:
df3 = pd.DataFrame({'Red':[1,2,3],'Green':[4,5,6]}, index = list('abc'))
df4 = pd.DataFrame({'Blue':[1,9,8],'Yellow':[6,6,7]}, index = list('cde'))
print(df3)
print(df4)

   Red  Green
a    1      4
b    2      5
c    3      6
   Blue  Yellow
c     1       6
d     9       6
e     8       7

In [135]:
df3

   Red  Green
a    1      4
b    2      5
c    3      6

In [136]:
df4

   Blue  Yellow
c     1       6
d     9       6
e     8       7

In [139]:
# 简单合并（默认left左连接，以左侧df3为基础）
df3.join(df4)

   Red  Green  Blue  Yellow
a    1      4   NaN     NaN
b    2      5   NaN     NaN
c    3      6   1.0     6.0

In [138]:
# 右连接
df3.join(df4, how = 'right')

   Red  Green  Blue  Yellow
c  3.0    6.0     1       6
d  NaN    NaN     9       6
e  NaN    NaN     8       7

In [140]:
# 外连接
df3.join(df4, how = 'outer')

   Red  Green  Blue  Yellow
a  1.0    4.0   NaN     NaN
b  2.0    5.0   NaN     NaN
c  3.0    6.0   1.0     6.0
d  NaN    NaN   9.0     6.0
e  NaN    NaN   8.0     7.0

In [141]:
df5 = DataFrame({'Brown':[3,4,5], 'White':[1,1,2]}, index = list('aed'))
df5

   Brown  White
a      3      1
e      4      1
d      5      2

In [143]:
# 合并多个DF
df3.join([df4,df5]) #还是默认左连接

   Red  Green  Blue  Yellow  Brown  White
a    1      4   NaN     NaN    3.0    1.0
b    2      5   NaN     NaN    NaN    NaN
c    3      6   1.0     6.0    NaN    NaN

In [144]:
df3.join([df4,df5], how = 'outer')

D:\Anaconda3\lib\site-packages\pandas\core\frame.py:6848: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  verify_integrity=True)

   Red  Green  Blue  Yellow  Brown  White
a  1.0    4.0   NaN     NaN    3.0    1.0
b  2.0    5.0   NaN     NaN    NaN    NaN
c  3.0    6.0   1.0     6.0    NaN    NaN
d  NaN    NaN   9.0     6.0    5.0    2.0
e  NaN    NaN   8.0     7.0    4.0    1.0

merge函数：

In [153]:
df1 = pd.DataFrame({'姓名': list('ABCED'), '性别':['M','F','M','M','F'], 
                   '职称': ['教授','副教授','副教授','讲师','助教']}, index = range(1001,1006))
df1.columns.name = '学院老师'
df1.index.name = '编号'
df1

学院老师 姓名 性别   职称
编号
1001  A  M   教授
1002  B  F  副教授
1003  C  M  副教授
1004  E  M   讲师
1005  D  F   助教

In [147]:
print(df1)

学院老师 姓名 性别   职称
编号
1001  A  M   教授
1002  B  F  副教授
1003  C  M  副教授
1004  E  M   讲师
1005  D  F   助教

In [154]:
df2 = pd.DataFrame({'姓名': list('ABDAW'),'Course': ['C++', 'Advenced Mathematics','Linear Algebra', 'Data Structure', 'Principle of Database'],
                   '职称': ['教授','副教授','讲师','教授','助教']}, index = [1001,1002,1004,1001,3001])

df2.columns.name = '课程名称'
df2.index.name = '编号'
df2

课程名称 姓名                 Course   职称
编号
1001  A                    C++   教授
1002  B   Advenced Mathematics  副教授
1004  D         Linear Algebra   讲师
1001  A         Data Structure   教授
3001  W  Principle of Database   助教

In [155]:
# 指定列名合并 
pd.merge(df1, df2, on = '姓名', suffixes = ['_1','_2'])

  姓名 性别 职称_1                Course 职称_2
0  A  M   教授                   C++   教授
1  A  M   教授        Data Structure   教授
2  B  F  副教授  Advenced Mathematics  副教授
3  D  F   助教        Linear Algebra   讲师

In [156]:
pd.merge(df1, df2, on = '姓名')

  姓名 性别 职称_x                Course 职称_y
0  A  M   教授                   C++   教授
1  A  M   教授        Data Structure   教授
2  B  F  副教授  Advenced Mathematics  副教授
3  D  F   助教        Linear Algebra   讲师

In [157]:
pd.merge(df1, df2, how = 'left')

  姓名 性别   职称                Course
0  A  M   教授                   C++
1  A  M   教授        Data Structure
2  B  F  副教授  Advenced Mathematics
3  C  M  副教授                   NaN
4  E  M   讲师                   NaN
5  D  F   助教                   NaN

In [158]:
pd.merge(df1, df2, how = 'right')

  姓名   性别   职称                 Course
0  A    M   教授                    C++
1  A    M   教授         Data Structure
2  B    F  副教授   Advenced Mathematics
3  D  NaN   讲师         Linear Algebra
4  W  NaN   助教  Principle of Database

In [159]:
pd.merge(df1, df2, how = 'outer')

  姓名   性别   职称                 Course
0  A    M   教授                    C++
1  A    M   教授         Data Structure
2  B    F  副教授   Advenced Mathematics
3  C    M  副教授                    NaN
4  E    M   讲师                    NaN
5  D    F   助教                    NaN
6  D  NaN   讲师         Linear Algebra
7  W  NaN   助教  Principle of Database

In [160]:
pd.merge(df1, df2, on = ['职称','姓名'])

  姓名 性别   职称                Course
0  A  M   教授                   C++
1  A  M   教授        Data Structure
2  B  F  副教授  Advenced Mathematics